package day03;

public class Example1 {
    public static void main(String[] args) {
        /*
            조건문(IF)
                1. 조건에 따른 결과를 제어
                2. 종류
                    (1)if ( 조건문 ) 참일때코드;
                    (2)if ( 조건문 ) {
                        참일때명령어1;
                        참일때명령어2;
                   }
                   (3)if(조건문) {
                   else{
                   거짓일때명령어;
                   }
                  }
                  (4)if(조건문1) { 참1일때명령어; }
                  else if (조건문2 ) { 참2일때명령어; }
                  else if (조건문3 ) { 참3일때명령어; }
                  else{ 거짓일때명령어; }

               (5) if (조건문1) { 참1일떄명령어; }
                   if (조건문2) { 참2일때명령어; }
                   if (조건문3) { 참3일떄명령어; }


                * 4번 : 여러 조건에 하나 결과 추출
                * 5번 : 여러 조건에 여러 결과 추출


           3. 주의할점
                (1) 조건문 자리 에는 true/false 만 가능하다.
                (2) { } 중괄호 관리
                (3) if(); if소괄호 뒤에 ;세미콜론
                (4) if , if ~else , if ~ else if 하나의 결과

         */
    }
}
